package Lingua::RU::Antimat;
use strict;
use 5.004;
use FileHandle;

$Lingua::RU::Antimat::VERSION = '0.20';

use locale;

sub new
{
	my $that = shift;
	my $class = ref($that)||$that;
	my $self= {};
	
	my $codepage=shift;
	if (defined($codepage)&&($codepage eq 'koi8'))
	{ 
		$self->{'word'}='a[\W_]*s[\W_]*s(?:[\W_]*e[\W_]*s)?|f[\W_]*u[\W_]*c[\W_]*k(?:[\W_]*i[\W_]*n[\W_]*g)?|÷[\W_]*(?:[Ÿ…iu][\W_]*[ƒd](?:[\W_]*[’Ÿ¡yiau]|[\W_]*[œo][\W_]*[◊bv])?|[œo][\W_]*[–np][\W_]*(?:[¡a](?:[\W_]*[»xh])?|[’≈Ÿeyiu]|[œo][\W_]*[ j]))|[ƒd][\W_]*[≈e][\W_]*[“pr][\W_]*(?:[ÿb][\W_]*)?[Õm][\W_]*[œ’≈¡eoyau](?:[\W_]*[Õm])?|[ﬁc][\W_]*[Õm][\W_]*(?:[œo]|[Ÿi][\W_]*[“pr][\W_]*[≈…ÿ—eibu])|[”sc][\W_]*[’uy][\W_]*(?:(?:[ﬁc][\W_]*)?[Àk][\W_]*[¡’…iyau](?:[\W_]*[Œhn](?:[\W_]*[œo][\W_]*[ j]|[\W_]*[’¡Ÿyiau])?)?|[ﬁc][\W_]*(?:(?:[ÿb][\W_]*)?(?:[≈£—…eiu]|[≈…eiu][\W_]*[ j])|[¡a][\W_]*[“pr][\W_]*[Ÿ¡’≈eyiau]))|[«rg][\W_]*(?:[¡œoa][\W_]*(?:[Œhn][\W_]*[ƒd][\W_]*[¡œoa][\W_]*[Œhn](?:[\W_]*[Ÿ’yiu])?|[◊bv][\W_]*[Œhn][\W_]*[œ¡oa](?:[\W_]*(?:[Õm]|[≈e][\W_]*[ƒd](?:[\W_]*[Ÿ’¡≈eyiau]|[\W_]*[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?)?))?)|[Œhn][\W_]*(?:[…iu][\W_]*[ƒd][\W_]*(?:[Ÿ’≈¡eyiau]|[œo][\W_]*[ j])|[’yu][”sc](?:[\W_]*[¡Ÿ’yiau]|[\W_]*[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?)?))|(?:[Œhn][\W_]*[≈e][\W_]*)?(?:(?:[⁄3z][\W_]*[¡a]|[œo][‘t]|[–np][\W_]*[œo]|[–np][\W_]*(?:[≈e][\W_]*[“pr][\W_]*[≈e]|[“pr][\W_]*[œ≈…eiou]|[…iu][\W_]*[⁄3z][\W_]*[ƒd][\W_]*[œo])|[Œhn][\W_]*[¡a]|[…iu][\W_]*[⁄3z]|[ƒd][\W_]*[œo]|[◊bv][\W_]*[Ÿi]|[’yu]|[“pr][\W_]*[¡a][\W_]*[⁄3z]|[⁄3z][\W_]*[Ãl][\W_]*[œo]|[‘t][\W_]*[“pr][\W_]*[œo]|[’yu])[\W_]*)?(?:[◊bv][\W_]*[Ÿi][\W_]*)?(?:[ﬂÿb][\W_]*)?(?:[≈£e][\W_]*[¬b](?:(?:[\W_]*[œ≈£¡…’eioyau])?(?:[\W_]*[Œhn](?:[\W_]*[Œhn])?[\W_]*[—’¡…ÿiybau]?)?(?:[\W_]*[◊bv][\W_]*[¡a])?(?:(?:[\W_]*(?:[…≈eiu]€[\W_]*[ÿb][\W_]*[”sc][\W_]*—|[‘t][\W_]*(?:(?:[ÿb][\W_]*)?[”sc][\W_]*—|[ÿb]|[≈e][\W_]*[”sc][\W_]*[ÿb]|[≈e]|[…iu][\W_]*[Œhn][\W_]*[’Ÿ≈¡eyiau])|(?:›[\W_]*(?:[…iu][\W_]*[ j]|[¡a][\W_]*—|[…≈eiu][\W_]*[≈e]|[≈e][\W_]*[«rg][\W_]*[œo])|¿[\W_]*[‘t])(?:[\W_]*[”sc][\W_]*—)?|[≈e][\W_]*[Õ‘mt]|[Àk](?:[\W_]*[…¡iau])?|[¡a][\W_]*[Ãl](?:[\W_]*[”sc][\W_]*—)?|[Ãl][\W_]*(?:[¡a][\W_]*[Œhn]|[œ¡oa](?:[\W_]*[Õm])?|(?:[…iu][\W_]*)?[”sc][\W_]*[ÿ—b]|[…iu]|[¡a][\W_]*[”sc][\W_]*[ÿb])|[“pr][\W_]*[ÿb]|[”sc][\W_]*[—ÿb]|[Œhn][\W_]*[œo]|[ﬁc][\W_]*(?:[…iu][\W_]*[»xh]|[≈e][\W_]*[”sc][\W_]*[‘t][\W_]*[ÿ…ibu](?:[\W_]*¿)?)|(?:[‘t][\W_]*[≈e][\W_]*[Ãl][\W_]*[ÿb][\W_]*[”sc][\W_]*[Àk][\W_]*|[”sc][\W_]*[‘t][\W_]*|[Ãl][\W_]*[…iu][\W_]*[◊bv][\W_]*|[ﬁ‘tc][\W_]*)?(?:[¡a][\W_]*—|[œo][\W_]*[ ≈Õejm]|[Ÿi][\W_]*[» ≈ejxh]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[…iu][\W_]*[≈e]|[œo][\W_]*[Õm][\W_]*[’yu]|[…iu][\W_]*[ j]|[≈e][\W_]*[◊bv]|[…iu][\W_]*[Õm](?:[\W_]*[…iu])?)|[ﬁ‘Ÿ …Ãijltcu]))?)|[\W_]*[Ÿi](?:(?:[\W_]*[◊bv][\W_]*[¡a]|[\W_]*[Œhn](?:[\W_]*[Œhn])?)(?:(?:[\W_]*(?:[…≈eiu]€[\W_]*[ÿb][\W_]*[”sc][\W_]*—|[‘t][\W_]*(?:[ÿb][\W_]*[”sc][\W_]*—|[ÿb]|[≈e][\W_]*[”sc][\W_]*[ÿb]|[≈e]|[…iu][\W_]*[Œhn][\W_]*[’Ÿ≈¡eyiau])|(?:›[\W_]*(?:[…iu][\W_]*[ j]|[¡a][\W_]*—|[…≈eiu][\W_]*[≈e]|[≈e][\W_]*[«rg][\W_]*[œo])|¿[\W_]*[‘t])(?:[\W_]*[”sc][\W_]*—)?|[≈e][\W_]*[Õ‘mt]|[Ãl][\W_]*(?:(?:[…iu][\W_]*)?[”sc][\W_]*[ÿ—b]|[…iu]|[¡a][\W_]*[”sc][\W_]*[ÿb])|(?:[”sc][\W_]*[‘t][\W_]*|[Ãl][\W_]*[…iu][\W_]*[◊bv][\W_]*|[ﬁ‘tc][\W_]*)?(?:[¡a][\W_]*—|[œo][\W_]*[ ≈Õejm]|[Ÿi][\W_]*[» ≈ejxh]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[…iu][\W_]*[≈e]|[œo][\W_]*[Õm][\W_]*[’yu]|[…iu][\W_]*[ j]|[≈e][\W_]*[◊bv]|[…iu][\W_]*[Õm](?:[\W_]*[…iu])?))))|[“pr][\W_]*[ÿb]))|—[\W_]*[¬b](?:[\W_]*[œ≈£¡…’eioyau])?(?:(?:[\W_]*[Œhn](?:[\W_]*[Œhn])?[\W_]*[—’¡…ÿiybau]?)?(?:(?:[\W_]*(?:[…≈eiu]€[\W_]*[ÿb][\W_]*[”sc][\W_]*—|[‘t][\W_]*(?:[ÿb][\W_]*[”sc][\W_]*—|[ÿb]|[≈e][\W_]*[”sc][\W_]*[ÿb]|[≈e]|[…iu][\W_]*[Œhn][\W_]*[’Ÿ≈¡eyiau])|(?:›[\W_]*(?:[…iu][\W_]*[ j]|[¡a][\W_]*—|[…≈eiu][\W_]*[≈e]|[≈e][\W_]*[«rg][\W_]*[œo])|¿[\W_]*[‘t])(?:[\W_]*[”sc][\W_]*—)?|[≈e][\W_]*[Õ‘mt]|[Àk](?:[\W_]*[…¡iau])?|[¡a][\W_]*[Ãl](?:[\W_]*[”sc][\W_]*—)?|[Ãl][\W_]*(?:[¡a][\W_]*[Œhn]|[œ¡oa](?:[\W_]*[Õm])?|(?:[…iu][\W_]*)?[”sc][\W_]*[ÿ—b]|[…iu])|[“pr][\W_]*[ÿb]|[”sc][\W_]*[—ÿb]|[Œhn][\W_]*[œo]|[ﬁc][\W_]*(?:[…iu][\W_]*[»xh]|[≈e][\W_]*[”sc][\W_]*[‘t][\W_]*[ÿ…ibu](?:[\W_]*¿)?)|(?:[‘t][\W_]*[≈e][\W_]*[Ãl][\W_]*[ÿb][\W_]*[”sc][\W_]*[Àk][\W_]*|[”sc][\W_]*[‘t][\W_]*|[Ãl][\W_]*[…iu][\W_]*[◊bv][\W_]*|[ﬁ‘tc][\W_]*)?(?:[¡a][\W_]*—|[œo][\W_]*[ ≈Õejm]|[Ÿi][\W_]*[» ≈ejxh]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[…iu][\W_]*[≈e]|[œo][\W_]*[Õm][\W_]*[’yu]|[…iu][\W_]*[ j]|[≈e][\W_]*[◊bv]|[…iu][\W_]*[Õm](?:[\W_]*[…iu])?)|[ﬁ‘ …Ãijltcu]))|(?:[\W_]*[Œhn](?:[\W_]*[Œhn])?[\W_]*[—’¡…ÿiybau]?))))|[≈e][\W_]*(?:[¬b][\W_]*(?:[’yu][\W_]*[Àk][\W_]*[≈e][\W_]*[Œhn][\W_]*[‘t][\W_]*[…iu][\W_]*[ j]|[≈e][\W_]*[Œhn][\W_]*(?:[ÿb]|—(?:[\W_]*[Õm])?)|[…iu][\W_]*(?:[√c][\W_]*[Àk][\W_]*[¡a][\W_]*—|[ﬁc][\W_]*[≈e][\W_]*[”sc][\W_]*[Àk][\W_]*[¡a][\W_]*—)|[Ãl][\W_]*[…iu][\W_]*›[\W_]*[≈e]|[¡a][\W_]*(?:[Ãl][\W_]*[ÿb][\W_]*[Œhn][\W_]*[…iu][\W_]*[Àk](?:[\W_]*[…¡iau])?|[‘t][\W_]*[œo][\W_]*[“pr][\W_]*[…iu][\W_]*[ j]|[Œhn][\W_]*(?:[‘t][\W_]*[“pr][\W_]*[œo][\W_]*[–np]|[¡a][\W_]*[‘t][\W_]*[…iu][\W_]*(?:[Àk]|[ﬁc][\W_]*[≈e][\W_]*[”sc][\W_]*[Àk][\W_]*[…iu][\W_]*[ j]))))|[ƒd][\W_]*[“pr][\W_]*[…iu][\W_]*[‘t])|[Œhn][\W_]*[≈e][\W_]*[◊bv][\W_]*[“pr][\W_]*[œo][\W_]*[‘t][\W_]*ﬂ[\W_]*[≈e][\W_]*[¬b][\W_]*[¡a][\W_]*[‘t][\W_]*[≈e][\W_]*[Ãl][\W_]*[ÿb][\W_]*[”sc][\W_]*[Àk][\W_]*[…iu][\W_]*(?:[Ÿ…iu][\W_]*[ j]|[¡a][\W_]*—|[œo][\W_]*[≈ ej]|[Ÿi][\W_]*[»xh]|[Ÿi][\W_]*[≈e]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu])|[’yu][\W_]*(?:[≈e][\W_]*[¬b][\W_]*(?:[…iu][\W_]*›[\W_]*[≈¡ea]|[¡a][\W_]*[Œhn](?:[\W_]*[‘t][\W_]*[’yu][\W_]*[”sc])?(?:[\W_]*[¡œoa][\W_]*[◊Õbmv]|[\W_]*[Ÿ’≈¡eyiau])?)|[“pr][\W_]*[œo][\W_]*[ƒd](?:[\W_]*[¡œoa][\W_]*[◊Õbmv]|[\W_]*[Ÿ’≈¡eyiau])?|[¬b][\W_]*[Ãl][\W_]*¿[\W_]*[ƒd][\W_]*(?:[œo][\W_]*[Àk]|[Àk][\W_]*(?:[¡œoa][\W_]*[◊Õbmv](?:[\W_]*[…iu])?|[…’≈¡eiyau])?))|[Õm][\W_]*(?:[’yu][\W_]*[ƒd][\W_]*(?:[œo][\W_]*[»xh][\W_]*[¡a][\W_]*(?:[‘t][\W_]*[ÿb][\W_]*[”sc][\W_]*—|¿[\W_]*[”sc][\W_]*[ÿb]|[≈e][\W_]*€[\W_]*[ÿb][\W_]*[”sc][\W_]*—)|[¡a][\W_]*(?:[Àk](?:[\W_]*[…¡iau]|[œo][Õ◊bmv])?|[ﬁc][\W_]*(?:[ÿb][\W_]*[≈£e]|[…iu][\W_]*[Œhn][\W_]*[’Ÿ¡yiau]|[Àk][\W_]*(?:[¡…≈’eiyau]|[œo][\W_]*[ j])))|[≈e][\W_]*[Œhn][\W_]*[ÿb]|[…iu][\W_]*[Ãl](?:[\W_]*[¡≈œŸeoia]?))|[¡a][\W_]*[Œhn][\W_]*[ƒd][\W_]*[’¡yau]|[Ãl][\W_]*(?:[…iu][\W_]*[Œhn]|—))|(?:[Õm][\W_]*(?:[œo][\W_]*[⁄3z][\W_]*[«rg]|[’yu][\W_]*[ƒd])|[ƒd][\W_]*(?:[œo][\W_]*[Ãl][\W_]*[¬b]|[’yu][\W_]*[“pr])|[”sc][\W_]*[Àk][\W_]*[œo][\W_]*[‘t]|÷[\W_]*[…iu][\W_]*[ƒd])[\W_]*[¡œoa][\W_]*[£≈e][\W_]*[¬b](?:[\W_]*[≈œeo][\W_]*[◊bv]|[\W_]*[Ÿ¡ia])?|(?:[Œhn][\W_]*[≈e][\W_]*|[⁄3z][\W_]*[¡a][\W_]*|[œo][\W_]*[‘t][\W_]*|[–np][\W_]*[œo][\W_]*|[Œhn][\W_]*[¡a][\W_]*|[“pr][\W_]*[¡a][\W_]*[”⁄3szc][\W_]*)?(?:[–np][\W_]*[…iu][\W_]*[⁄3z][\W_]*[ƒd][\W_]*[…—≈eiu]|(?:ﬂ)?[≈£e][\W_]*[¬b][\W_]*[¡a])[\W_]*(?:(?:[‘t][\W_]*[ÿb][\W_]*[”sc][\W_]*—|[‘t][\W_]*[ÿb]|[Ãl][\W_]*[…iu]|[¡a][\W_]*[Ãl]|[Ãl]|c[\W_]*[ÿb]|[…iu][\W_]*[‘t]|[…iu]|[‘t][\W_]*[≈e]|[ﬁc][\W_]*[’yu]|€[\W_]*[ÿb])|(?:[ —…iju]|[…≈eiu][\W_]*[Õm](?:[\W_]*[…iu])?|[ j][\W_]*[”sc][\W_]*(?:[Àk][\W_]*(?:[Ÿ…iu][\W_]*[ ≈ej]|[¡a][\W_]*—|[œo][\W_]*[≈e]|[Ÿi][\W_]*[»xh]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu])|[‘t][\W_]*[◊bv][\W_]*[œ’¡oyau](?:[\W_]*[Õm])?)))|[–np][\W_]*[≈…Ÿeiu][\W_]*[ƒd][\W_]*[¡≈‹œeoa][\W_]*[“pr](?:(?:[\W_]*[¡a][\W_]*[”⁄3szc](?:(?:[\W_]*[‘t])?(?:[\W_]*[Ÿi]|[\W_]*[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?|[\W_]*[Àk][\W_]*[¡…iau])?|(?:[\W_]*[Ÿ’¡≈eyiau]|[\W_]*[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?|[\W_]*[œo][\W_]*[◊bv])))|[\W_]*(?:[Ÿ’¡≈eyiau]|[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?|[œo][\W_]*[◊bv]|[Œhn][\W_]*—))?|[–np][\W_]*[…iu][\W_]*[⁄3z][\W_]*(?:[ÿb][\W_]*)?[ƒd][\W_]*(?:[£≈e][\W_]*(?:[Œhn][\W_]*[Ÿi][\W_]*€(?:[\W_]*[ÿb])?|[€Œ÷hn](?:[\W_]*[ÿb])?)|[’yu][\W_]*(?:[ j](?:[\W_]*[‘t][\W_]*[≈e])?|[Œhn](?:[\W_]*[Ÿi])?)|¿[\W_]*(?:[Àk](?:[\W_]*(?:[¡≈’…eiyau]|[œo][\W_]*[◊bv]|[¡a][\W_]*[Õm](?:[\W_]*[…iu])?))?|[Ãl](?:[ÿ…ibu]|[≈e][\W_]*[ j]|—[\W_]*[»Õmxh]))|[≈e][\W_]*[√c]|[¡œoa][\W_]*(?:[Œhn][\W_]*[’yu][\W_]*)?[‘t][\W_]*(?:[…iu][\W_]*[ j]|[¡a][\W_]*—|[œo](?:[\W_]*[≈ ej])?|[Ÿi][\W_]*[≈ »ejxh]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu]|[≈e][\W_]*[≈e]|[¡’ÿ≈Ÿeyibau])|[¡a][\W_]*[Œhn][\W_]*[’yu][\W_]*[Ãl](?:[\W_]*[¡…iau])?|[Ÿ≈’…¡eiyau]|[œ¡oa][\W_]*(?:[ j]|[»xh][\W_]*[’yu][\W_]*[ j]|[≈£e][\W_]*[¬b]|(?:[“pr][\W_]*[œo][\W_]*[‘t]|[«rg][\W_]*[œo][\W_]*[Ãl][\W_]*[œo][\W_]*[◊bv])[\W_]*(?:[Ÿ…iu][\W_]*[ j]|[¡a][\W_]*—|[œo][\W_]*[≈ ej]|[Ÿi][\W_]*[»xh]|[Ÿi][\W_]*[≈e]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu])|[¬b][\W_]*(?:[“pr][\W_]*[¡a][\W_]*[‘t][\W_]*[…iu][\W_]*—|[œo][\W_]*[Ãl](?:[\W_]*[¡Ÿ’yiau])?)))|[–np][\W_]*(?:[¡a][\W_]*[ƒd][\W_]*[Ãl][\W_]*[¡œŸoia]|[œ¡oa][\W_]*[”sc][\W_]*[Àk][\W_]*[’yu][\W_]*[ƒd][\W_]*(?:[Ÿ’¡≈eyiau]|[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?)|[…≈eiu][\W_]*[ƒd][\W_]*(?:[…iu][\W_]*[Àk]|[“pr][\W_]*[…iu][\W_]*[Ãl](?:[\W_]*[Ãl])?)(?:[\W_]*[œ¡oa][\W_]*[Õ◊bmv]|[\W_]*[…’≈œŸ¡eioyau])?|[“pr][\W_]*[œo][\W_]*[¬b][\W_]*[Ãl][\W_]*—[\W_]*[ƒd][\W_]*[œo][\W_]*[Õm])|(?:[⁄3z][\W_]*[¡a][\W_]*|[œo][\W_]*[‘t][\W_]*|[Œhn][\W_]*[¡a][\W_]*)?[”sc][\W_]*[“pr][\W_]*(?:[¡a][\W_]*[‘t][\W_]*[ÿb]|[¡a][\W_]*[Ãl](?:[\W_]*[…iu])?|[e’…iyu])|[”sc][\W_]*[“pr][\W_]*[¡a][\W_]*(?:[Àk][\W_]*(?:[¡≈…’eiyau]|[œo][\W_]*[ j])|[Œhn][\W_]*(?:[Œhn][\W_]*)?(?:[ÿb]|(?:[Ÿi][\W_]*[ ≈ej]|[¡a][\W_]*—|[œo][\W_]*[≈e])))|(?:[⁄3z][\W_]*[¡a][\W_]*)?[‘t][\W_]*[“pr][\W_]*[¡a][\W_]*[»xh][\W_]*(?:[Œhn][\W_]*(?:[’yu](?:[\W_]*[‘t][\W_]*[ÿb](?:[\W_]*[”sc][\W_]*—)?|[\W_]*[”sc][\W_]*[ÿb]|[\W_]*[Ãl](?:[\W_]*[¡…iau])?)?|[≈…eiu][\W_]*€[\W_]*[ÿb][\W_]*[”sc][\W_]*—)|[¡a][\W_]*(?:[Ãl](?:[\W_]*[¡œ…ioau])?|[‘t][\W_]*[ÿb](?:[\W_]*[”sc][\W_]*—)?|[Œhn][\W_]*(?:[Œhn][\W_]*)?(?:[Ÿ…iu][\W_]*[ j]|[¡a][\W_]*—|[œo][\W_]*[ ≈ej]|[Ÿi][\W_]*[»xh]|[Ÿi][\W_]*[≈e]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu])))|(?:[Œhn][\W_]*[…≈eiu][\W_]*|[–np][\W_]*[œo][\W_]*|[Œhn][\W_]*[¡a][\W_]*|[œ¡oa][\W_]*(?:[‘t][\W_]*)?|[ƒd][\W_]*[¡œoa][\W_]*|[⁄3z][\W_]*[¡a][\W_]*)?(?:(?:[∆f][\W_]*[…iu][\W_]*[«rg]|[»xh][\W_]*(?:[≈…eiu][\W_]*(?:[ j][\W_]*)?[“pr]|[“pr][\W_]*[≈e][\W_]*[Œhn]|[’yu](?:[\W_]*[ j])?))(?:[\W_]*[≈œ£eo][\W_]*[◊bv](?:[\W_]*[¡a][\W_]*¿[\W_]*›|[\W_]*€)?)?(?:[\W_]*[¡…≈eiau][\W_]*[ÃŒlhn])?(?:[Œhn])?(?:[\W_]*(?:[…¡œ£—Ÿ≈eioau][¿—…≈◊Õ beijmvu]|—[\W_]*(?:[Õm](?:[\W_]*[…iu])?|[“pr][\W_]*(?:¿|[…iu][\W_]*[Ãl](?:[\W_]*[…œ¡ioau])?)|[ﬁc][\W_]*(?:[¡a][\W_]*[‘t]|[…iu][\W_]*[Ãl](?:[\W_]*[…œ¡ioau])?)|[ﬁc](?:[\W_]*[ÿb])?)|[≈e][\W_]*(?:[‘t][\W_]*(?:[œo][\W_]*[ j]|[¡ÿ’ybau])|[≈e][\W_]*(?:[‘t][\W_]*[≈e]|€[\W_]*[ÿb]))|[¡Ÿœ’—¿ …ijoyau]|[Ãl][\W_]*[…œiou]|[ﬁc][\W_]*[’yu])))|(?:[∆f][\W_]*[…iu][\W_]*[«rg]|[»xh][\W_]*(?:[≈…eiu][\W_]*(?:[ j][\W_]*)?[“pr]|[“pr][\W_]*[≈e][\W_]*[Œhn]|[’yu][\W_]*[ j]))|[»xh][\W_]*[’yu][\W_]*(?:[≈…eiu][\W_]*(?:[”sc][\W_]*[œo][\W_]*[”sc]|[–np][\W_]*[Ãl][\W_]*[≈e][\W_]*[‘t])(?:[\W_]*[¡Ÿ’yiau]|[\W_]*[œ¡oa][\W_]*[Õm](?:[\W_]*[…iu])?|[Œhn][\W_]*(?:[Ÿ…iu][\W_]*[ j]|[¡a][\W_]*—|[œo][\W_]*[ ≈ej]|[Ÿi][\W_]*[»xh]|[Ÿi][\W_]*[≈e]|[Ÿi][\W_]*[Õm](?:[\W_]*[…iu])?|[’yu][\W_]*¿|[œo][\W_]*[Õm][\W_]*[’yu]))?|[ƒd][\W_]*[œo][\W_]*£[\W_]*[¬b][\W_]*[…iu][\W_]*[Œhn][\W_]*(?:[œo][\W_]*[ j]|[¡≈Ÿ’eyiau]))|[¬b][\W_]*[Ãl][\W_]*—(?:[\W_]*[ƒ‘dt][\W_]*(?:[ÿb]|[…iu]|[Àk][\W_]*[…iu]|[”sc][\W_]*[‘t][\W_]*[◊bv][\W_]*[œo]|[”sc][\W_]*[Àk][\W_]*(?:[œo][\W_]*[≈ ej]|[…iu][\W_]*[≈e]|[¡a][\W_]*—|[…iu][\W_]*[ j]|[œo][\W_]*[«rg][\W_]*[œo])))?|[◊bv][\W_]*[Ÿi][\W_]*[¬b][\W_]*[Ãl][\W_]*—[\W_]*[ƒd][\W_]*(?:[œo][\W_]*[Àk]|[Àk][\W_]*(?:[…’¡≈eiyau]|[¡a][\W_]*[Õm](?:[\W_]*[…iu])?))|(?:[⁄3z][\W_]*[¡œoa][\W_]*)(?:[–np][\W_]*[¡œoa][\W_]*[ƒd][\W_]*[Ãl][\W_]*[œŸ¡oia]|[Ãl][\W_]*[’yu][\W_]*[–np][\W_]*(?:[œo][\W_]*[ j]|[¡≈Ÿ’eyiau]))|€[\W_]*[Ãl][\W_]*¿[\W_]*[»xh][\W_]*(?:[¡’≈…eiyau]|[œo][\W_]*[ j])|[¡a][\W_]*[Œhn][\W_]*[’yu][\W_]*[”sc](?:[\W_]*[≈¡Ÿ’eyiau]|[\W_]*[œo][\W_]*[Õm])?|(?:\w*(?:[»xh](?:[“pr][≈e][Œhn]|[’yu][…≈eiu])|[–np][≈…eiu](?:[⁄3z][ƒd]|[ƒd](?:[≈¡œeoa][“pr]|[“pr]))|[¬b][Ãl]—[ƒd]|[œo][»xh][’yu][≈e]|[Õm][’yu][ƒd][≈œ…¡eioau]|[ƒd][≈e][“pr][ÿb]|[«rg][¡œoa][◊bv][Œhn]|[’yu][≈e][¬b])|[»xh][\W_]*(?:[“pr][\W_]*[≈e][\W_]*[Œhn]|[’yu][\W_]*[ …≈—eiju])|[–np][\W_]*[≈…eiu][\W_]*(?:[⁄3z][\W_]*[ƒd]|[ƒd][\W_]*(?:[≈¡œeoa][\W_]*[“pr]|[“pr]))|[¬b][\W_]*[Ãl][\W_]*—[\W_]*[ƒd]|[œo][\W_]*[»xh][\W_]*[’yu][\W_]*[≈e]|[Õm][\W_]*[’yu][\W_]*[ƒd][\W_]*[≈œ…¡eioau]|[ƒd][\W_]*[≈e][\W_]*[“pr][\W_]*[ÿb]|[«rg][\W_]*[¡œoa][\W_]*[◊bv][\W_]*[Œhn]|[’yu][\W_]*[≈e][\W_]*[¬b]|[£≈e][¬b])\w+';
		$self->{'bip'}='¬…–';
	}	
	
	
	else 
	{
		$self->{'word'}='a[\W_]*s[\W_]*s(?:[\W_]*e[\W_]*s)?|f[\W_]*u[\W_]*c[\W_]*k(?:[\W_]*i[\W_]*n[\W_]*g)?|Ê[\W_]*(?:[˚Ëiu][\W_]*[‰d](?:[\W_]*[Û˚‡yiau]|[\W_]*[Óo][\W_]*[‚bv])?|[Óo][\W_]*[Ônp][\W_]*(?:[‡a](?:[\W_]*[ıxh])?|[ÛÂ˚eyiu]|[Óo][\W_]*[Èj]))|[‰d][\W_]*[Âe][\W_]*[pr][\W_]*(?:[¸b][\W_]*)?[Ïm][\W_]*[ÓÛÂ‡eoyau](?:[\W_]*[Ïm])?|[˜c][\W_]*[Ïm][\W_]*(?:[Óo]|[˚i][\W_]*[pr][\W_]*[ÂË¸ˇeibu])|[Òsc][\W_]*[Ûuy][\W_]*(?:(?:[˜c][\W_]*)?[Ík][\W_]*[‡ÛËiyau](?:[\W_]*[Ìhn](?:[\W_]*[Óo][\W_]*[Èj]|[\W_]*[Û‡˚yiau])?)?|[˜c][\W_]*(?:(?:[¸b][\W_]*)?(?:[Â∏ˇËeiu]|[ÂËeiu][\W_]*[Èj])|[‡a][\W_]*[pr][\W_]*[˚‡ÛÂeyiau]))|[„rg][\W_]*(?:[‡Óoa][\W_]*(?:[Ìhn][\W_]*[‰d][\W_]*[‡Óoa][\W_]*[Ìhn](?:[\W_]*[˚Ûyiu])?|[‚bv][\W_]*[Ìhn][\W_]*[Ó‡oa](?:[\W_]*(?:[Ïm]|[Âe][\W_]*[‰d](?:[\W_]*[˚Û‡Âeyiau]|[\W_]*[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?)?))?)|[Ìhn][\W_]*(?:[Ëiu][\W_]*[‰d][\W_]*(?:[˚ÛÂ‡eyiau]|[Óo][\W_]*[Èj])|[Ûyu][Òsc](?:[\W_]*[‡˚Ûyiau]|[\W_]*[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?)?))|(?:[Ìhn][\W_]*[Âe][\W_]*)?(?:(?:[Á3z][\W_]*[‡a]|[Óo][Út]|[Ônp][\W_]*[Óo]|[Ônp][\W_]*(?:[Âe][\W_]*[pr][\W_]*[Âe]|[pr][\W_]*[ÓÂËeiou]|[Ëiu][\W_]*[Á3z][\W_]*[‰d][\W_]*[Óo])|[Ìhn][\W_]*[‡a]|[Ëiu][\W_]*[Á3z]|[‰d][\W_]*[Óo]|[‚bv][\W_]*[˚i]|[Ûyu]|[pr][\W_]*[‡a][\W_]*[Á3z]|[Á3z][\W_]*[Îl][\W_]*[Óo]|[Út][\W_]*[pr][\W_]*[Óo]|[Ûyu])[\W_]*)?(?:[‚bv][\W_]*[˚i][\W_]*)?(?:[˙¸b][\W_]*)?(?:[Â∏e][\W_]*[·b](?:(?:[\W_]*[ÓÂ∏‡ËÛeioyau])?(?:[\W_]*[Ìhn](?:[\W_]*[Ìhn])?[\W_]*[ˇÛ‡Ë¸iybau]?)?(?:[\W_]*[‚bv][\W_]*[‡a])?(?:(?:[\W_]*(?:[ËÂeiu]¯[\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ|[Út][\W_]*(?:(?:[¸b][\W_]*)?[Òsc][\W_]*ˇ|[¸b]|[Âe][\W_]*[Òsc][\W_]*[¸b]|[Âe]|[Ëiu][\W_]*[Ìhn][\W_]*[Û˚Â‡eyiau])|(?:˘[\W_]*(?:[Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[ËÂeiu][\W_]*[Âe]|[Âe][\W_]*[„rg][\W_]*[Óo])|˛[\W_]*[Út])(?:[\W_]*[Òsc][\W_]*ˇ)?|[Âe][\W_]*[ÏÚmt]|[Ík](?:[\W_]*[Ë‡iau])?|[‡a][\W_]*[Îl](?:[\W_]*[Òsc][\W_]*ˇ)?|[Îl][\W_]*(?:[‡a][\W_]*[Ìhn]|[Ó‡oa](?:[\W_]*[Ïm])?|(?:[Ëiu][\W_]*)?[Òsc][\W_]*[¸ˇb]|[Ëiu]|[‡a][\W_]*[Òsc][\W_]*[¸b])|[pr][\W_]*[¸b]|[Òsc][\W_]*[ˇ¸b]|[Ìhn][\W_]*[Óo]|[˜c][\W_]*(?:[Ëiu][\W_]*[ıxh]|[Âe][\W_]*[Òsc][\W_]*[Út][\W_]*[¸Ëibu](?:[\W_]*˛)?)|(?:[Út][\W_]*[Âe][\W_]*[Îl][\W_]*[¸b][\W_]*[Òsc][\W_]*[Ík][\W_]*|[Òsc][\W_]*[Út][\W_]*|[Îl][\W_]*[Ëiu][\W_]*[‚bv][\W_]*|[˜Útc][\W_]*)?(?:[‡a][\W_]*ˇ|[Óo][\W_]*[ÈÂÏejm]|[˚i][\W_]*[ıÈÂejxh]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Ëiu][\W_]*[Âe]|[Óo][\W_]*[Ïm][\W_]*[Ûyu]|[Ëiu][\W_]*[Èj]|[Âe][\W_]*[‚bv]|[Ëiu][\W_]*[Ïm](?:[\W_]*[Ëiu])?)|[˜Ú˚ÈËÎijltcu]))?)|[\W_]*[˚i](?:(?:[\W_]*[‚bv][\W_]*[‡a]|[\W_]*[Ìhn](?:[\W_]*[Ìhn])?)(?:(?:[\W_]*(?:[ËÂeiu]¯[\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ|[Út][\W_]*(?:[¸b][\W_]*[Òsc][\W_]*ˇ|[¸b]|[Âe][\W_]*[Òsc][\W_]*[¸b]|[Âe]|[Ëiu][\W_]*[Ìhn][\W_]*[Û˚Â‡eyiau])|(?:˘[\W_]*(?:[Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[ËÂeiu][\W_]*[Âe]|[Âe][\W_]*[„rg][\W_]*[Óo])|˛[\W_]*[Út])(?:[\W_]*[Òsc][\W_]*ˇ)?|[Âe][\W_]*[ÏÚmt]|[Îl][\W_]*(?:(?:[Ëiu][\W_]*)?[Òsc][\W_]*[¸ˇb]|[Ëiu]|[‡a][\W_]*[Òsc][\W_]*[¸b])|(?:[Òsc][\W_]*[Út][\W_]*|[Îl][\W_]*[Ëiu][\W_]*[‚bv][\W_]*|[˜Útc][\W_]*)?(?:[‡a][\W_]*ˇ|[Óo][\W_]*[ÈÂÏejm]|[˚i][\W_]*[ıÈÂejxh]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Ëiu][\W_]*[Âe]|[Óo][\W_]*[Ïm][\W_]*[Ûyu]|[Ëiu][\W_]*[Èj]|[Âe][\W_]*[‚bv]|[Ëiu][\W_]*[Ïm](?:[\W_]*[Ëiu])?))))|[pr][\W_]*[¸b]))|ˇ[\W_]*[·b](?:[\W_]*[ÓÂ∏‡ËÛeioyau])?(?:(?:[\W_]*[Ìhn](?:[\W_]*[Ìhn])?[\W_]*[ˇÛ‡Ë¸iybau]?)?(?:(?:[\W_]*(?:[ËÂeiu]¯[\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ|[Út][\W_]*(?:[¸b][\W_]*[Òsc][\W_]*ˇ|[¸b]|[Âe][\W_]*[Òsc][\W_]*[¸b]|[Âe]|[Ëiu][\W_]*[Ìhn][\W_]*[Û˚Â‡eyiau])|(?:˘[\W_]*(?:[Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[ËÂeiu][\W_]*[Âe]|[Âe][\W_]*[„rg][\W_]*[Óo])|˛[\W_]*[Út])(?:[\W_]*[Òsc][\W_]*ˇ)?|[Âe][\W_]*[ÏÚmt]|[Ík](?:[\W_]*[Ë‡iau])?|[‡a][\W_]*[Îl](?:[\W_]*[Òsc][\W_]*ˇ)?|[Îl][\W_]*(?:[‡a][\W_]*[Ìhn]|[Ó‡oa](?:[\W_]*[Ïm])?|(?:[Ëiu][\W_]*)?[Òsc][\W_]*[¸ˇb]|[Ëiu])|[pr][\W_]*[¸b]|[Òsc][\W_]*[ˇ¸b]|[Ìhn][\W_]*[Óo]|[˜c][\W_]*(?:[Ëiu][\W_]*[ıxh]|[Âe][\W_]*[Òsc][\W_]*[Út][\W_]*[¸Ëibu](?:[\W_]*˛)?)|(?:[Út][\W_]*[Âe][\W_]*[Îl][\W_]*[¸b][\W_]*[Òsc][\W_]*[Ík][\W_]*|[Òsc][\W_]*[Út][\W_]*|[Îl][\W_]*[Ëiu][\W_]*[‚bv][\W_]*|[˜Útc][\W_]*)?(?:[‡a][\W_]*ˇ|[Óo][\W_]*[ÈÂÏejm]|[˚i][\W_]*[ıÈÂejxh]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Ëiu][\W_]*[Âe]|[Óo][\W_]*[Ïm][\W_]*[Ûyu]|[Ëiu][\W_]*[Èj]|[Âe][\W_]*[‚bv]|[Ëiu][\W_]*[Ïm](?:[\W_]*[Ëiu])?)|[˜ÚÈËÎijltcu]))|(?:[\W_]*[Ìhn](?:[\W_]*[Ìhn])?[\W_]*[ˇÛ‡Ë¸iybau]?))))|[Âe][\W_]*(?:[·b][\W_]*(?:[Ûyu][\W_]*[Ík][\W_]*[Âe][\W_]*[Ìhn][\W_]*[Út][\W_]*[Ëiu][\W_]*[Èj]|[Âe][\W_]*[Ìhn][\W_]*(?:[¸b]|ˇ(?:[\W_]*[Ïm])?)|[Ëiu][\W_]*(?:[ˆc][\W_]*[Ík][\W_]*[‡a][\W_]*ˇ|[˜c][\W_]*[Âe][\W_]*[Òsc][\W_]*[Ík][\W_]*[‡a][\W_]*ˇ)|[Îl][\W_]*[Ëiu][\W_]*˘[\W_]*[Âe]|[‡a][\W_]*(?:[Îl][\W_]*[¸b][\W_]*[Ìhn][\W_]*[Ëiu][\W_]*[Ík](?:[\W_]*[Ë‡iau])?|[Út][\W_]*[Óo][\W_]*[pr][\W_]*[Ëiu][\W_]*[Èj]|[Ìhn][\W_]*(?:[Út][\W_]*[pr][\W_]*[Óo][\W_]*[Ônp]|[‡a][\W_]*[Út][\W_]*[Ëiu][\W_]*(?:[Ík]|[˜c][\W_]*[Âe][\W_]*[Òsc][\W_]*[Ík][\W_]*[Ëiu][\W_]*[Èj]))))|[‰d][\W_]*[pr][\W_]*[Ëiu][\W_]*[Út])|[Ìhn][\W_]*[Âe][\W_]*[‚bv][\W_]*[pr][\W_]*[Óo][\W_]*[Út][\W_]*˙[\W_]*[Âe][\W_]*[·b][\W_]*[‡a][\W_]*[Út][\W_]*[Âe][\W_]*[Îl][\W_]*[¸b][\W_]*[Òsc][\W_]*[Ík][\W_]*[Ëiu][\W_]*(?:[˚Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[Óo][\W_]*[ÂÈej]|[˚i][\W_]*[ıxh]|[˚i][\W_]*[Âe]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu])|[Ûyu][\W_]*(?:[Âe][\W_]*[·b][\W_]*(?:[Ëiu][\W_]*˘[\W_]*[Â‡ea]|[‡a][\W_]*[Ìhn](?:[\W_]*[Út][\W_]*[Ûyu][\W_]*[Òsc])?(?:[\W_]*[‡Óoa][\W_]*[‚Ïbmv]|[\W_]*[˚ÛÂ‡eyiau])?)|[pr][\W_]*[Óo][\W_]*[‰d](?:[\W_]*[‡Óoa][\W_]*[‚Ïbmv]|[\W_]*[˚ÛÂ‡eyiau])?|[·b][\W_]*[Îl][\W_]*˛[\W_]*[‰d][\W_]*(?:[Óo][\W_]*[Ík]|[Ík][\W_]*(?:[‡Óoa][\W_]*[‚Ïbmv](?:[\W_]*[Ëiu])?|[ËÛÂ‡eiyau])?))|[Ïm][\W_]*(?:[Ûyu][\W_]*[‰d][\W_]*(?:[Óo][\W_]*[ıxh][\W_]*[‡a][\W_]*(?:[Út][\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ|˛[\W_]*[Òsc][\W_]*[¸b]|[Âe][\W_]*¯[\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ)|[‡a][\W_]*(?:[Ík](?:[\W_]*[Ë‡iau]|[Óo][Ï‚bmv])?|[˜c][\W_]*(?:[¸b][\W_]*[Â∏e]|[Ëiu][\W_]*[Ìhn][\W_]*[Û˚‡yiau]|[Ík][\W_]*(?:[‡ËÂÛeiyau]|[Óo][\W_]*[Èj])))|[Âe][\W_]*[Ìhn][\W_]*[¸b]|[Ëiu][\W_]*[Îl](?:[\W_]*[‡ÂÓ˚eoia]?))|[‡a][\W_]*[Ìhn][\W_]*[‰d][\W_]*[Û‡yau]|[Îl][\W_]*(?:[Ëiu][\W_]*[Ìhn]|ˇ))|(?:[Ïm][\W_]*(?:[Óo][\W_]*[Á3z][\W_]*[„rg]|[Ûyu][\W_]*[‰d])|[‰d][\W_]*(?:[Óo][\W_]*[Îl][\W_]*[·b]|[Ûyu][\W_]*[pr])|[Òsc][\W_]*[Ík][\W_]*[Óo][\W_]*[Út]|Ê[\W_]*[Ëiu][\W_]*[‰d])[\W_]*[‡Óoa][\W_]*[∏Âe][\W_]*[·b](?:[\W_]*[ÂÓeo][\W_]*[‚bv]|[\W_]*[˚‡ia])?|(?:[Ìhn][\W_]*[Âe][\W_]*|[Á3z][\W_]*[‡a][\W_]*|[Óo][\W_]*[Út][\W_]*|[Ônp][\W_]*[Óo][\W_]*|[Ìhn][\W_]*[‡a][\W_]*|[pr][\W_]*[‡a][\W_]*[ÒÁ3szc][\W_]*)?(?:[Ônp][\W_]*[Ëiu][\W_]*[Á3z][\W_]*[‰d][\W_]*[ËˇÂeiu]|(?:˙)?[Â∏e][\W_]*[·b][\W_]*[‡a])[\W_]*(?:(?:[Út][\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ|[Út][\W_]*[¸b]|[Îl][\W_]*[Ëiu]|[‡a][\W_]*[Îl]|[Îl]|c[\W_]*[¸b]|[Ëiu][\W_]*[Út]|[Ëiu]|[Út][\W_]*[Âe]|[˜c][\W_]*[Ûyu]|¯[\W_]*[¸b])|(?:[ÈˇËiju]|[ËÂeiu][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Èj][\W_]*[Òsc][\W_]*(?:[Ík][\W_]*(?:[˚Ëiu][\W_]*[ÈÂej]|[‡a][\W_]*ˇ|[Óo][\W_]*[Âe]|[˚i][\W_]*[ıxh]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu])|[Út][\W_]*[‚bv][\W_]*[ÓÛ‡oyau](?:[\W_]*[Ïm])?)))|[Ônp][\W_]*[ÂË˚eiu][\W_]*[‰d][\W_]*[‡Â˝Óeoa][\W_]*[pr](?:(?:[\W_]*[‡a][\W_]*[ÒÁ3szc](?:(?:[\W_]*[Út])?(?:[\W_]*[˚i]|[\W_]*[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[\W_]*[Ík][\W_]*[‡Ëiau])?|(?:[\W_]*[˚Û‡Âeyiau]|[\W_]*[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[\W_]*[Óo][\W_]*[‚bv])))|[\W_]*(?:[˚Û‡Âeyiau]|[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Óo][\W_]*[‚bv]|[Ìhn][\W_]*ˇ))?|[Ônp][\W_]*[Ëiu][\W_]*[Á3z][\W_]*(?:[¸b][\W_]*)?[‰d][\W_]*(?:[∏Âe][\W_]*(?:[Ìhn][\W_]*[˚i][\W_]*¯(?:[\W_]*[¸b])?|[¯ÌÊhn](?:[\W_]*[¸b])?)|[Ûyu][\W_]*(?:[Èj](?:[\W_]*[Út][\W_]*[Âe])?|[Ìhn](?:[\W_]*[˚i])?)|˛[\W_]*(?:[Ík](?:[\W_]*(?:[‡ÂÛËeiyau]|[Óo][\W_]*[‚bv]|[‡a][\W_]*[Ïm](?:[\W_]*[Ëiu])?))?|[Îl](?:[¸Ëibu]|[Âe][\W_]*[Èj]|ˇ[\W_]*[ıÏmxh]))|[Âe][\W_]*[ˆc]|[‡Óoa][\W_]*(?:[Ìhn][\W_]*[Ûyu][\W_]*)?[Út][\W_]*(?:[Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[Óo](?:[\W_]*[ÂÈej])?|[˚i][\W_]*[ÂÈıejxh]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu]|[Âe][\W_]*[Âe]|[‡Û¸Â˚eyibau])|[‡a][\W_]*[Ìhn][\W_]*[Ûyu][\W_]*[Îl](?:[\W_]*[‡Ëiau])?|[˚ÂÛË‡eiyau]|[Ó‡oa][\W_]*(?:[Èj]|[ıxh][\W_]*[Ûyu][\W_]*[Èj]|[Â∏e][\W_]*[·b]|(?:[pr][\W_]*[Óo][\W_]*[Út]|[„rg][\W_]*[Óo][\W_]*[Îl][\W_]*[Óo][\W_]*[‚bv])[\W_]*(?:[˚Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[Óo][\W_]*[ÂÈej]|[˚i][\W_]*[ıxh]|[˚i][\W_]*[Âe]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu])|[·b][\W_]*(?:[pr][\W_]*[‡a][\W_]*[Út][\W_]*[Ëiu][\W_]*ˇ|[Óo][\W_]*[Îl](?:[\W_]*[‡˚Ûyiau])?)))|[Ônp][\W_]*(?:[‡a][\W_]*[‰d][\W_]*[Îl][\W_]*[‡Ó˚oia]|[Ó‡oa][\W_]*[Òsc][\W_]*[Ík][\W_]*[Ûyu][\W_]*[‰d][\W_]*(?:[˚Û‡Âeyiau]|[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?)|[ËÂeiu][\W_]*[‰d][\W_]*(?:[Ëiu][\W_]*[Ík]|[pr][\W_]*[Ëiu][\W_]*[Îl](?:[\W_]*[Îl])?)(?:[\W_]*[Ó‡oa][\W_]*[Ï‚bmv]|[\W_]*[ËÛÂÓ˚‡eioyau])?|[pr][\W_]*[Óo][\W_]*[·b][\W_]*[Îl][\W_]*ˇ[\W_]*[‰d][\W_]*[Óo][\W_]*[Ïm])|(?:[Á3z][\W_]*[‡a][\W_]*|[Óo][\W_]*[Út][\W_]*|[Ìhn][\W_]*[‡a][\W_]*)?[Òsc][\W_]*[pr][\W_]*(?:[‡a][\W_]*[Út][\W_]*[¸b]|[‡a][\W_]*[Îl](?:[\W_]*[Ëiu])?|[eÛËiyu])|[Òsc][\W_]*[pr][\W_]*[‡a][\W_]*(?:[Ík][\W_]*(?:[‡ÂËÛeiyau]|[Óo][\W_]*[Èj])|[Ìhn][\W_]*(?:[Ìhn][\W_]*)?(?:[¸b]|(?:[˚i][\W_]*[ÈÂej]|[‡a][\W_]*ˇ|[Óo][\W_]*[Âe])))|(?:[Á3z][\W_]*[‡a][\W_]*)?[Út][\W_]*[pr][\W_]*[‡a][\W_]*[ıxh][\W_]*(?:[Ìhn][\W_]*(?:[Ûyu](?:[\W_]*[Út][\W_]*[¸b](?:[\W_]*[Òsc][\W_]*ˇ)?|[\W_]*[Òsc][\W_]*[¸b]|[\W_]*[Îl](?:[\W_]*[‡Ëiau])?)?|[ÂËeiu][\W_]*¯[\W_]*[¸b][\W_]*[Òsc][\W_]*ˇ)|[‡a][\W_]*(?:[Îl](?:[\W_]*[‡ÓËioau])?|[Út][\W_]*[¸b](?:[\W_]*[Òsc][\W_]*ˇ)?|[Ìhn][\W_]*(?:[Ìhn][\W_]*)?(?:[˚Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[Óo][\W_]*[ÈÂej]|[˚i][\W_]*[ıxh]|[˚i][\W_]*[Âe]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu])))|(?:[Ìhn][\W_]*[ËÂeiu][\W_]*|[Ônp][\W_]*[Óo][\W_]*|[Ìhn][\W_]*[‡a][\W_]*|[Ó‡oa][\W_]*(?:[Út][\W_]*)?|[‰d][\W_]*[‡Óoa][\W_]*|[Á3z][\W_]*[‡a][\W_]*)?(?:(?:[Ùf][\W_]*[Ëiu][\W_]*[„rg]|[ıxh][\W_]*(?:[ÂËeiu][\W_]*(?:[Èj][\W_]*)?[pr]|[pr][\W_]*[Âe][\W_]*[Ìhn]|[Ûyu](?:[\W_]*[Èj])?))(?:[\W_]*[ÂÓ∏eo][\W_]*[‚bv](?:[\W_]*[‡a][\W_]*˛[\W_]*˘|[\W_]*¯)?)?(?:[\W_]*[‡ËÂeiau][\W_]*[ÎÌlhn])?(?:[Ìhn])?(?:[\W_]*(?:[Ë‡Ó∏ˇ˚Âeioau][˛ˇËÂ‚ÏÈbeijmvu]|ˇ[\W_]*(?:[Ïm](?:[\W_]*[Ëiu])?|[pr][\W_]*(?:˛|[Ëiu][\W_]*[Îl](?:[\W_]*[ËÓ‡ioau])?)|[˜c][\W_]*(?:[‡a][\W_]*[Út]|[Ëiu][\W_]*[Îl](?:[\W_]*[ËÓ‡ioau])?)|[˜c](?:[\W_]*[¸b])?)|[Âe][\W_]*(?:[Út][\W_]*(?:[Óo][\W_]*[Èj]|[‡¸Ûybau])|[Âe][\W_]*(?:[Út][\W_]*[Âe]|¯[\W_]*[¸b]))|[‡˚ÓÛˇ˛ÈËijoyau]|[Îl][\W_]*[ËÓiou]|[˜c][\W_]*[Ûyu])))|(?:[Ùf][\W_]*[Ëiu][\W_]*[„rg]|[ıxh][\W_]*(?:[ÂËeiu][\W_]*(?:[Èj][\W_]*)?[pr]|[pr][\W_]*[Âe][\W_]*[Ìhn]|[Ûyu][\W_]*[Èj]))|[ıxh][\W_]*[Ûyu][\W_]*(?:[ÂËeiu][\W_]*(?:[Òsc][\W_]*[Óo][\W_]*[Òsc]|[Ônp][\W_]*[Îl][\W_]*[Âe][\W_]*[Út])(?:[\W_]*[‡˚Ûyiau]|[\W_]*[Ó‡oa][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ìhn][\W_]*(?:[˚Ëiu][\W_]*[Èj]|[‡a][\W_]*ˇ|[Óo][\W_]*[ÈÂej]|[˚i][\W_]*[ıxh]|[˚i][\W_]*[Âe]|[˚i][\W_]*[Ïm](?:[\W_]*[Ëiu])?|[Ûyu][\W_]*˛|[Óo][\W_]*[Ïm][\W_]*[Ûyu]))?|[‰d][\W_]*[Óo][\W_]*∏[\W_]*[·b][\W_]*[Ëiu][\W_]*[Ìhn][\W_]*(?:[Óo][\W_]*[Èj]|[‡Â˚Ûeyiau]))|[·b][\W_]*[Îl][\W_]*ˇ(?:[\W_]*[‰Údt][\W_]*(?:[¸b]|[Ëiu]|[Ík][\W_]*[Ëiu]|[Òsc][\W_]*[Út][\W_]*[‚bv][\W_]*[Óo]|[Òsc][\W_]*[Ík][\W_]*(?:[Óo][\W_]*[ÂÈej]|[Ëiu][\W_]*[Âe]|[‡a][\W_]*ˇ|[Ëiu][\W_]*[Èj]|[Óo][\W_]*[„rg][\W_]*[Óo])))?|[‚bv][\W_]*[˚i][\W_]*[·b][\W_]*[Îl][\W_]*ˇ[\W_]*[‰d][\W_]*(?:[Óo][\W_]*[Ík]|[Ík][\W_]*(?:[ËÛ‡Âeiyau]|[‡a][\W_]*[Ïm](?:[\W_]*[Ëiu])?))|(?:[Á3z][\W_]*[‡Óoa][\W_]*)(?:[Ônp][\W_]*[‡Óoa][\W_]*[‰d][\W_]*[Îl][\W_]*[Ó˚‡oia]|[Îl][\W_]*[Ûyu][\W_]*[Ônp][\W_]*(?:[Óo][\W_]*[Èj]|[‡Â˚Ûeyiau]))|¯[\W_]*[Îl][\W_]*˛[\W_]*[ıxh][\W_]*(?:[‡ÛÂËeiyau]|[Óo][\W_]*[Èj])|[‡a][\W_]*[Ìhn][\W_]*[Ûyu][\W_]*[Òsc](?:[\W_]*[Â‡˚Ûeyiau]|[\W_]*[Óo][\W_]*[Ïm])?|(?:\w*(?:[ıxh](?:[pr][Âe][Ìhn]|[Ûyu][ËÂeiu])|[Ônp][ÂËeiu](?:[Á3z][‰d]|[‰d](?:[Â‡Óeoa][pr]|[pr]))|[·b][Îl]ˇ[‰d]|[Óo][ıxh][Ûyu][Âe]|[Ïm][Ûyu][‰d][ÂÓË‡eioau]|[‰d][Âe][pr][¸b]|[„rg][‡Óoa][‚bv][Ìhn]|[Ûyu][Âe][·b])|[ıxh][\W_]*(?:[pr][\W_]*[Âe][\W_]*[Ìhn]|[Ûyu][\W_]*[ÈËÂˇeiju])|[Ônp][\W_]*[ÂËeiu][\W_]*(?:[Á3z][\W_]*[‰d]|[‰d][\W_]*(?:[Â‡Óeoa][\W_]*[pr]|[pr]))|[·b][\W_]*[Îl][\W_]*ˇ[\W_]*[‰d]|[Óo][\W_]*[ıxh][\W_]*[Ûyu][\W_]*[Âe]|[Ïm][\W_]*[Ûyu][\W_]*[‰d][\W_]*[ÂÓË‡eioau]|[‰d][\W_]*[Âe][\W_]*[pr][\W_]*[¸b]|[„rg][\W_]*[‡Óoa][\W_]*[‚bv][\W_]*[Ìhn]|[Ûyu][\W_]*[Âe][\W_]*[·b]|[∏Âe][·b])\w+';
		$self->{'bip'}='·ËÔ';
	}

	bless $self,$class;
	return $self;
		
}


sub remove_slang
{
	
	my ($self,$slang)=@_;

	
	eval
	{
		#$slang =~s/(?<=[\W_])($self->{'word'})(?=[\W_])/$self->{'bip'}/gi;
		#$slang =~s/(\b|_)(?:$self->{'word'})(\b|_)/$1bip$2/gi;	
		#$slang =~s/(?:\b|_)(?:$self->{'word'})(?:\b|_)//gi;

		$slang =~s/(?:\b|(?<=_))(?:$self->{'word'})(?:\b|(?=_))/$self->{'bip'}/gi;
  	
	};
	
	die "Fatal error: bad regular expression!" if $@;

	return $slang; 
}


sub detect_slang
{
	
	my ($self,$slang)=@_;
	my $match;
	
	eval 
	{
		$match=($slang =~m/(?:\b|(?<=_))(?:$self->{'word'})(?:\b|(?=_))/i);	
		
     };
	
	 die "Fatal error: bad regular expression!" if $@;

	return $match; 
}

sub set_bip
{
	my ($self,$bip)=@_;
	$self->{'bip'}=$bip;
}

sub load_dict
{
	my ($self,$file)=@_;
	
	local($/) = undef;
	my $FH = new FileHandle("$file")||die "Can't open $file!";
	my $dict=<$FH>;
	close($FH);
  	$dict=~ s/\015?\012/|/g;
  	
  	eval { '1'=~m/$dict/; };
	die "Bad regular expression in dictionary $file!" if $@;
	
	$self->{'word'}=$self->{'word'}.'|'.$dict;

}



1;

__END__


=head1 NAME

Lingua::RU::Antimat - Perl Module for removal Russian slang from chat, guestbooks, etc.

=head1 SYNOPSIS

use POSIX qw(locale_h);

use Lingua::RU::Antimat;

use locale;

setlocale(LC_CTYPE,"ru_RU.CP1251"); 

$dirty_text='text with slang';

$mat= Lingua::RU::Antimat->new;

#load dictionary with additional words

$mat->load_dict('/home/www/badwords');

$mat->set_bip('Sorry!');

$clean_text=$mat->remove_slang($dirty_text);


=head1 RUSSIAN DOCUMENTATION

Detailed Russian documentation and tutorial available on http://www.tcen.ru/antimat

=head1 DESCRIPTION

This module will remove Russian slang from a string. 'Mat' is Russian name for such bad words and  that is why this module is called Antimat. 

=over

=item $mat=Lingua::RU::Antimat->new($codepage);

This method creates a new object and returns it.
If new() is called without any arguments, the module will use templates for text in encoding win-1251.
If your text in encoding KOI8-R set $codepage equal 'koi8'.

Examples:

$mat=Lingua::RU::Antimat->new; #for text in win-1251

$mat=Lingua::RU::Antimat->new('koi8'); #for text in KOI8-R 

=item $clean_text=$mat->remove_slang($dirty_text);

Method remove_slang takes string and returns string where all 
bad words replaced on Russian analog 'bip' or string you set in method set_bip
which is described later.

=item $badwords=$mat->detect_slang($dirty_text);

Method detect_slang takes string and returns boolean value. This value equal 1
if there is bad word in the string and 0 if there is no such words in the string. 

=item $mat->set_bip($bip);

Set the string (usually word) which will replace bad words in method remove_slang.

Examples:

$mat->set_bip(''); #let strip out slang

$mat->set_bip('I am sorry!'); #long but also correct

=item $mat->load_dict($file);

This method loads dictionary with additional bad words. Each string in the dictionary should be a word or regular expression. $file could be relative or absolute path to the dictionary.

=back

=head1 SEE ALSO

Detailed Russian documentation on http://www.tcen.ru/antimat

perllocale manpage

=head1 CREDITS

Andrey Skorohod, marlenus@marlenus.com for his bug reports.

Thanks!

=head1 AUTHOR

Ilya Soldatkin, arc@tcen.ru

Drop me a line if you deploy this module on your site. Think about this as a small contribution to my efforts for writing and supporting this module. I can not improve this module if I will know that no one uses it. 

=head1 COPYRIGHT

Copyright 2001 Ilya Soldatkin. All rights reserved.

This library is free software; you can redistribute it and/or
modify it under the same terms as Perl itself.

=cut
